USE UNIVER;
GO

INSERT INTO TIMETABLE (IDGROUP, AUDITORIUM_NAME, SUBJECT, TEACHER, DAYSOFWEEK, LESSON)
VALUES 
    (22, N'301-1', N'БД',   N'СМЛВ', N'Понедельник', 1),
    (23, N'304-4', N'ОАиП', N'УРБ',  N'Понедельник', 1), 
    (24, N'423-1', N'КГ',   N'МРЗ',  N'Понедельник', 2), 
    (22, N'313-1', N'СУБД', N'СМЛВ', N'Понедельник', 3),
    
    (25, N'301-1', N'БД',   N'СМЛВ', N'Вторник',     1),
    (25, N'304-4', N'ОАиП', N'УРБ',  N'Вторник',     2),
    (26, N'206-1', N'ПИС',  N'ЖЛК',  N'Вторник',     2),
    (25, N'313-1', N'КГ',   N'МРЗ',  N'Вторник',     4),

    (23, N'236-1', N'ПСП',  N'ГРН',  N'Среда',       2),
    (24, N'301-1', N'БД',   N'СМЛВ', N'Среда',       2);
GO

SELECT * FROM TIMETABLE;

