use X_MyBase;

--1
select 
    isnull(P.[Название подразделения], N'ИТОГО ПО ПРЕДПРИЯТИЮ') as [Подразделение],
    isnull(O.[Тип оборудования], N'Итого по подразделению') as [Тип оборудования],
    sum(O.Количество) as [Списано штук]
from 
    Списания as S
inner join Подразделения as P on S.[ID Подразделения] = P.[ID Подразделения]
inner join Оборудование as O on S.[ID Оборудования] = O.[Оборудования ID]
group by 
    rollup (P.[Название подразделения], O.[Тип оборудования]);


--2
select 
    isnull(E.Фамилия, N'ВСЕ СОТРУДНИКИ') as [Ответственный сотрудник],
    isnull(O.[Тип оборудования], N'ВСЕ ТИПЫ ОБОРУДОВАНИЯ') as [Тип оборудования],
    count(S.[ID Списания]) as [Количество актов списания]
from 
    Списания as S
inner join Сотрудники as E on S.[ID сотрудника] = E.[ID Сотрудника]
inner join Оборудование as O on S.[ID Оборудования] = O.[Оборудования ID]
group by 
    cube (E.Фамилия, O.[Тип оборудования]);


--3
select 
    P.[Название подразделения],
    O.[Название оборудования],
    S.[Причина списания]
from Списания as S
inner join Подразделения as P on S.[ID Подразделения] = P.[ID Подразделения]
inner join Оборудование as O on S.[ID Оборудования] = O.[Оборудования ID]
where S.[Причина списания] in (N'Физический износ', N'Моральное устаревание')
union all
select 
    P.[Название подразделения],
    O.[Название оборудования],
    S.[Причина списания]
from Списания as S
inner join Подразделения as P on S.[ID Подразделения] = P.[ID Подразделения]
inner join Оборудование as O on S.[ID Оборудования] = O.[Оборудования ID]
where S.[Причина списания] in (N'Поломка', N'Неисправность');


--4
select E.Фамилия, E.Должность
from Списания S
inner join Сотрудники E on S.[ID сотрудника] = E.[ID Сотрудника]
where year(S.[Дата списания]) = 2023
intersect
select E.Фамилия, E.Должность
from Списания S
inner join Сотрудники E on S.[ID сотрудника] = E.[ID Сотрудника]
where year(S.[Дата списания]) = 2024;


--5
select E.Фамилия, E.Должность
from Списания S
inner join Сотрудники E on S.[ID сотрудника] = E.[ID Сотрудника]
where year(S.[Дата списания]) = 2024
except
select E.Фамилия, E.Должность
from Списания S
inner join Сотрудники E on S.[ID сотрудника] = E.[ID Сотрудника]
where year(S.[Дата списания]) = 2023;