use X_MyBase;
go


create view Сотрудники_Отдела_Кадров as
select 
    [ID Сотрудника] as [Табельный номер],
    Фамилия,
    Имя,
    Должность
from Сотрудники
where [ID Сотрудника] in (
    select [ID Сотрудника] from Списания where [ID Подразделения] = 2
);
go

create view Статистика_Списаний as
select 
    O.[Тип оборудования],
    count(S.[ID Списания]) as [Всего актов списания]
from Оборудование O
join Списания S on O.[Оборудования ID] = S.[ID Оборудования]
group by O.[Тип оборудования];
go


create view Только_Машины as
select 
    [Оборудования ID],
    [Название оборудования],
    Количество,
    [Тип оборудования]
from Оборудование
where [Тип оборудования] = N'Машина';
go

create view Водокачки_Строго as
select 
    [Оборудования ID],
    [Название оборудования],
    Количество,
    [Тип оборудования]
from Оборудование
where [Тип оборудования] = N'Водокачка'
with check option;
go

create view Топ_Дорогих_Поломок as
select top 100 percent
    S.[ID Списания] as [Акт №],
    O.[Название оборудования] as [Техника],
    S.[Причина списания] as [Причина],
    S.[Дата списания] as [Дата]
from Списания S
join Оборудование O on S.[ID Оборудования] = O.[Оборудования ID]
order by S.[Дата списания] desc;
go

create view Защищенный_Отчет
with schemabinding
as
select 
    P.[Название подразделения] as [Отдел],
    count_big(S.[ID Списания]) as [Актов оформлено]
from dbo.Подразделения P
join dbo.Списания S on P.[ID Подразделения] = S.[ID Подразделения]
group by P.[Название подразделения];
go
